DROP DATABASE IF EXISTS `DEMO_DB_QZ`; #Егер DEMO_DB_QZ деген дерекқор бар болса, ол өшіріледі.
CREATE DATABASE `DEMO_DB_QZ`; # DEMO_DB_QZ деген жаңа дерекқор жасалады.
USE `DEMO_DB_QZ`; /*Осы команданы орындағаннан кейін, DEMO_DB_QZ дерекқоры белсенді болады, яғни барлық кейінгі CREATE TABLE, INSERT, SELECT командалары осы дерекқор ішінде орындалады.*/

#Төмендегі скриптерді кестелер құру үшін және деректермен толтыру үшін қолдан.
CREATE TABLE employee_demographics (
  employee_id INT NOT NULL,
  first_name VARCHAR(50),
  last_name VARCHAR(50),
  age INT,
  gender VARCHAR(10),
  birth_date DATE,
  PRIMARY KEY (employee_id)
);

CREATE TABLE employee_salary (
  employee_id INT NOT NULL,
  first_name VARCHAR(50) NOT NULL,
  last_name VARCHAR(50) NOT NULL,
  occupation VARCHAR(50),
  salary INT,
  dept_id INT
);

INSERT INTO employee_demographics (employee_id, first_name, last_name, age, gender, birth_date)
VALUES
(1, 'Лесли', 'Кнопе', 44, 'Әйел', '1979-09-25'),
(3, 'Том', 'Хаверфорд', 36, 'Еркек', '1987-03-04'),
(4, 'Эйприл', 'Лудгейт', 29, 'Әйел', '1994-03-27'),
(5, 'Джерри', 'Гергич', 61, 'Еркек', '1962-08-28'),
(6, 'Донна', 'Мигл', 46, 'Әйел', '1977-07-30'),
(7, 'Анн', 'Перкинс', 35, 'Әйел', '1988-12-01'),
(8, 'Крис', 'Траегер', 43, 'Еркек', '1980-11-11'),
(9, 'Бен', 'Уайатт', 38, 'Еркек', '1985-07-26'),
(10, 'Энди', 'Дуайер', 34, 'Еркек', '1989-03-25'),
(11, 'Марк', 'Бренданович', 40, 'Еркек', '1983-06-14'),
(12, 'Крейг', 'Миддлбрукс', 37, 'Еркек', '1986-07-27');

INSERT INTO employee_salary (employee_id, first_name, last_name, occupation, salary, dept_id)
VALUES
(1, 'Лесли', 'Кнопе', 'Парктер мен рекреация бойынша орынбасар директоры', 75000, 1),
(2, 'Рон', 'Свансон', 'Парктер мен рекреация директоры', 70000, 1),
(3, 'Том', 'Хаверфорд', 'Кәсіпкер', 50000, 1),
(4, 'Эйприл', 'Лудгейт', 'Парктер мен рекреация директорының көмекшісі', 25000, 1),
(5, 'Джерри', 'Гергич', 'Офис менеджері', 50000, 1),
(6, 'Донна', 'Мигл', 'Офис менеджері', 60000, 1),
(7, 'Анн', 'Перкинс', 'Мейірбике', 55000, 4),
(8, 'Крис', 'Траегер', 'Қала менеджері', 90000, 3),
(9, 'Бен', 'Уайатт', 'Мемлекеттік аудиторы', 70000, 6),
(10, 'Энди', 'Дуайер', 'Аяқ киім тазалаушы және музыкант', 20000, NULL),
(11, 'Марк', 'Бренданович', 'Қала жоспарлаушысы', 57000, 3),
(12, 'Крейг', 'Миддлбрукс', 'Парктер директоры', 65000, 1);

CREATE TABLE parks_departments (
  department_id INT NOT NULL AUTO_INCREMENT,
  department_name VARCHAR(50) NOT NULL,
  PRIMARY KEY (department_id)
);

INSERT INTO parks_departments (department_name)
VALUES
('Парктер мен рекреация'),
('Жануарлармен бақылау'),
('Қоғамдық жұмыстар'),
('Денсаулық сақтау'),
('Кітапхана'),
('Қаржы');


